{
  "audioSegments": [
    {
      "id": "intro",
      "text": "สวัสดีค่ะ ยินดีต้อนรับสู่บทเรียน Daily Living: Coffee, Groceries, and Healthy Routines วันนี้เราจะฝึกพูดประโยคสั้นๆ ที่ใช้จริงเวลาไปคาเฟ่ ซื้อของซูเปอร์ และคุยเรื่องกิจวัตรเพื่อสุขภาพ ฟังให้เข้าใจ แล้วพูดตามแบบสบายๆ ไปด้วยกันนะ",
      "textParts": [
        {
          "text": "สวัสดีค่ะ ยินดีต้อนรับสู่บทเรียน Daily Living: Coffee, Groceries, and Healthy Routines วันนี้เราจะฝึกพูดประโยคสั้นๆ ที่ใช้จริงเวลาไปคาเฟ่ ซื้อของซูเปอร์ และคุยเรื่องกิจวัตรเพื่อสุขภาพ ฟังให้เข้าใจ แล้วพูดตามแบบสบายๆ ไปด้วยกันนะ",
          "language": "th"
        }
      ],
      "description": "แนะนำบทเรียนอย่างเป็นกันเอง อธิบายโฟกัสของคลาสวันนี้และชวนผู้เรียนเตรียมพูดตาม",
      "screenElement": "title_card",
      "visualDescription": "Bright, friendly title animation introducing the lesson theme with icons of a coffee cup, shopping basket, and alarm clock.",
      "backgroundImageDescription": "Modern classroom at a Bangkok university with Thai students, BTS Skytrain visible through large windows, soft daylight, Thai campus posters on the walls."
    },
    {
      "id": "learning_objective1",
      "text": "เป้าหมายแรก เราจะฝึกสั่งกาแฟอย่างสุภาพ ถามราคารวมภาษี บอกวิธีจ่ายเงิน และสะสมแต้มที่ร้านในไทย ฟังประโยคตัวอย่าง แล้วพูดตามทีละส่วนให้ชัดนะ เช่น Can I get ...? และ How much is it with tax? ต่อด้วย I'd like to pay by credit card. ปิดท้ายด้วย Can you add my phone number for points?",
      "textParts": [
        {
          "text": "เป้าหมายแรก เราจะฝึกสั่งกาแฟอย่างสุภาพ ถามราคารวมภาษี บอกวิธีจ่ายเงิน และสะสมแต้มที่ร้านในไทย ฟังประโยคตัวอย่าง แล้วพูดตามทีละส่วนให้ชัดนะ เช่น ",
          "language": "th"
        },
        {
          "text": "Can I get ...?",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " และ ",
          "language": "th"
        },
        {
          "text": "How much is it with tax?",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " ต่อด้วย ",
          "language": "th"
        },
        {
          "text": "I'd like to pay by credit card.",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " ปิดท้ายด้วย ",
          "language": "th"
        },
        {
          "text": "Can you add my phone number for points?",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "อธิบายสิ่งที่จะฝึกในสถานการณ์ร้านกาแฟไทย ตั้งแต่สั่ง ปรับแต่ง ถามราคารวมภาษี จ่ายบัตร และขอสะสมแต้ม",
      "screenElement": "objective_card",
      "visualDescription": "Simple on-screen checklist with a coffee cup icon and each English phrase highlighted one by one.",
      "backgroundImageDescription": "TRUE Coffee counter at Siam Square One; Thai barista, menu boards with drink sizes and milk options in Thai and English, contactless payment terminal, loyalty QR code sign."
    },
    {
      "id": "learning_objective2",
      "text": "เป้าหมายที่สอง เราจะชวนคุยเรื่องกิจวัตรประจำวัน พูดถึงเวลาตื่น การเดินทาง และขอคำแนะนำสุขภาพ เริ่มจากถามเพื่อนว่า What's your daily routine? จากนั้นตอบสั้นๆ ด้วย I usually ... แล้วถ้าต้องการขอคำแนะนำ ใช้ Any advice for ...? และปิดด้วยการตอบรับแบบสุภาพ Thanks, I'll try.",
      "textParts": [
        {
          "text": "เป้าหมายที่สอง เราจะชวนคุยเรื่องกิจวัตรประจำวัน พูดถึงเวลาตื่น การเดินทาง และขอคำแนะนำสุขภาพ เริ่มจากถามเพื่อนว่า ",
          "language": "th"
        },
        {
          "text": "What's your daily routine?",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " จากนั้นตอบสั้นๆ ด้วย ",
          "language": "th"
        },
        {
          "text": "I usually ...",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " แล้วถ้าต้องการขอคำแนะนำ ใช้ ",
          "language": "th"
        },
        {
          "text": "Any advice for ...?",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " และปิดด้วยการตอบรับแบบสุภาพ ",
          "language": "th"
        },
        {
          "text": "Thanks, I'll try.",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "สรุปทักษะที่ต้องใช้ในการคุยเรื่องกิจวัตรและสุขภาพ พร้อมประโยคถาม ตอบ และขอคำแนะนำ",
      "screenElement": "objective_card",
      "visualDescription": "Two chat bubbles show a question and a short response, emphasizing the key phrases.",
      "backgroundImageDescription": "Morning scene at Chulalongkorn University campus lawn with pink building in the distance, students walking toward BTS Siam, soft sunrise lighting."
    },
    {
      "id": "vocab_section",
      "text": "คำศัพท์: section — แปลว่า แผนกหรือโซนในซูเปอร์มาร์เก็ต เวลาเดินเลือกของที่ Big C เรามักหาโซนก่อน ตัวอย่างประโยค: The dairy section is next to the produce section.",
      "textParts": [
        {
          "text": "คำศัพท์: ",
          "language": "th"
        },
        {
          "text": "section",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " — แปลว่า แผนกหรือโซนในซูเปอร์มาร์เก็ต เวลาเดินเลือกของที่ Big C เรามักหาโซนก่อน ตัวอย่างประโยค: ",
          "language": "th"
        },
        {
          "text": "The dairy section is next to the produce section.",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "อธิบายความหมายและการใช้คำว่า section กับตัวอย่างประโยคที่เกี่ยวกับซูเปอร์ในไทย",
      "screenElement": "vocabulary_card",
      "vocabWord": "section",
      "visualDescription": "Highlight of the word with an aisle map graphic and arrows showing different sections.",
      "backgroundImageDescription": "Interior of Big C Ratchadamri supermarket with clear bilingual aisle signs for dairy and produce, Thai shoppers pushing carts, bright fluorescent lighting."
    },
    {
      "id": "vocab_routine",
      "text": "คำศัพท์: routine — หมายถึง กิจวัตรประจำวัน สิ่งที่ทำซ้ำๆ ทุกวัน เช่น ตื่น กินข้าว เดินทาง ตัวอย่างประโยค: My morning routine helps me save time.",
      "textParts": [
        {
          "text": "คำศัพท์: ",
          "language": "th"
        },
        {
          "text": "routine",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " — หมายถึง กิจวัตรประจำวัน สิ่งที่ทำซ้ำๆ ทุกวัน เช่น ตื่น กินข้าว เดินทาง ตัวอย่างประโยค: ",
          "language": "th"
        },
        {
          "text": "My morning routine helps me save time.",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "ช่วยจำคำว่า routine พร้อมตัวอย่างที่เชื่อมกับการบริหารเวลาเช้า",
      "screenElement": "vocabulary_card",
      "vocabWord": "routine",
      "visualDescription": "Calendar and alarm clock icons with a simple morning checklist animation.",
      "backgroundImageDescription": "Bangkok condo bedroom scene at sunrise with a student packing a backpack, BTS tracks visible outside the window, tidy desk with Thai textbooks."
    },
    {
      "id": "vocab_alarm",
      "text": "คำศัพท์: alarm — แปลว่า นาฬิกาปลุก ใช้ตั้งเวลาให้ตื่นหรือเตือนงานสำคัญ ตัวอย่างประโยค: Set an alarm for 6:00 a.m.",
      "textParts": [
        {
          "text": "คำศัพท์: ",
          "language": "th"
        },
        {
          "text": "alarm",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " — แปลว่า นาฬิกาปลุก ใช้ตั้งเวลาให้ตื่นหรือเตือนงานสำคัญ ตัวอย่างประโยค: ",
          "language": "th"
        },
        {
          "text": "Set an alarm for 6:00 a.m.",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "อธิบายการใช้ alarm เพื่อช่วยจัดการเวลาในตอนเช้า",
      "screenElement": "vocabulary_card",
      "vocabWord": "alarm",
      "visualDescription": "Close-up of a smartphone screen showing an alarm set for 6:00 a.m.",
      "backgroundImageDescription": "Thai dorm room nightstand with a phone in Thai language UI, small plant, and a glass of water; soft warm lamp light."
    },
    {
      "id": "vocab_snooze",
      "text": "คำศัพท์: snooze — แปลว่า เลื่อนปลุกหรืองีบต่อ ใช้เมื่อยังไม่อยากตื่น ตัวอย่างประโยค: Don't hit snooze three times.",
      "textParts": [
        {
          "text": "คำศัพท์: ",
          "language": "th"
        },
        {
          "text": "snooze",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " — แปลว่า เลื่อนปลุกหรืองีบต่อ ใช้เมื่อยังไม่อยากตื่น ตัวอย่างประโยค: ",
          "language": "th"
        },
        {
          "text": "Don't hit snooze three times.",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "ช่วยจำความหมาย snooze และเตือนให้ไม่เลื่อนปลุกบ่อยเกินไป",
      "screenElement": "vocabulary_card",
      "vocabWord": "snooze",
      "visualDescription": "Person reaching toward a phone with a big SNOOZE button visible.",
      "backgroundImageDescription": "Small Bangkok apartment bedroom with cozy bedding, morning light peeking through curtains, phone showing an alarm with Thai numerals."
    },
    {
      "id": "vocab_skip",
      "text": "คำศัพท์: skip — หมายถึง ข้ามหรือเว้น เช่น เว้นมื้อเย็นที่ไม่ดีต่อสุขภาพ ตัวอย่างประโยค: I'll skip fast food tonight.",
      "textParts": [
        {
          "text": "คำศัพท์: ",
          "language": "th"
        },
        {
          "text": "skip",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " — หมายถึง ข้ามหรือเว้น เช่น เว้นมื้อเย็นที่ไม่ดีต่อสุขภาพ ตัวอย่างประโยค: ",
          "language": "th"
        },
        {
          "text": "I'll skip fast food tonight.",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "สอนการใช้ skip ในชีวิตประจำวันเพื่อสุขภาพที่ดีขึ้น",
      "screenElement": "vocabulary_card",
      "vocabWord": "skip",
      "visualDescription": "A crossed-out burger icon and a green checkmark on a salad bowl icon.",
      "backgroundImageDescription": "Terminal 21 Pier 21 food court with various Thai food stalls; a student choosing a salad bar over fried options, vibrant signage in Thai."
    },
    {
      "id": "vocab_fast_food",
      "text": "คำศัพท์: fast food — แปลว่า อาหารจานด่วน สะดวกแต่ไม่ค่อยดีต่อสุขภาพถ้ากินบ่อย ตัวอย่างประโยค: Fast food is convenient but not always healthy.",
      "textParts": [
        {
          "text": "คำศัพท์: ",
          "language": "th"
        },
        {
          "text": "fast food",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " — แปลว่า อาหารจานด่วน สะดวกแต่ไม่ค่อยดีต่อสุขภาพถ้ากินบ่อย ตัวอย่างประโยค: ",
          "language": "th"
        },
        {
          "text": "Fast food is convenient but not always healthy.",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "อธิบายข้อดีข้อเสียของ fast food และเชื่อมกับการเลือกที่ดีต่อสุขภาพ",
      "screenElement": "vocabulary_card",
      "vocabWord": "fast food",
      "visualDescription": "Split-screen graphic comparing a burger combo and a healthier rice-and-veggies plate.",
      "backgroundImageDescription": "Front of a 7-Eleven in Bangkok with shelves of ready-made meals, Thai calorie labels visible, customers using TrueMoney Wallet at the counter."
    },
    {
      "id": "vocab_healthy",
      "text": "คำศัพท์: healthy — หมายถึง ดีต่อสุขภาพ ใช้บรรยายอาหาร เครื่องดื่ม หรือพฤติกรรมที่ส่งเสริมสุขภาพ ตัวอย่างประโยค: Almond milk is a healthy option for my iced coffee.",
      "textParts": [
        {
          "text": "คำศัพท์: ",
          "language": "th"
        },
        {
          "text": "healthy",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " — หมายถึง ดีต่อสุขภาพ ใช้บรรยายอาหาร เครื่องดื่ม หรือพฤติกรรมที่ส่งเสริมสุขภาพ ตัวอย่างประโยค: ",
          "language": "th"
        },
        {
          "text": "Almond milk is a healthy option for my iced coffee.",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "ชี้แนะการใช้คำว่า healthy ในบริบทเครื่องดื่มและโภชนาการ",
      "screenElement": "vocabulary_card",
      "vocabWord": "healthy",
      "visualDescription": "Green checkmark overlay on an iced latte with almond milk, with a small calorie icon.",
      "backgroundImageDescription": "Café Amazon kiosk at BTS Mo Chit station; barista pouring almond milk into iced coffee, Thai signage for alternative milks visible."
    },
    {
      "id": "vocab_mystery",
      "text": "คำศัพท์: mystery — แนวลึกลับหรือสืบสวน ใช้เวลาเลือกหนังหรือซีรีส์ ตัวอย่างประโยค: Let's watch a mystery tonight.",
      "textParts": [
        {
          "text": "คำศัพท์: ",
          "language": "th"
        },
        {
          "text": "mystery",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " — แนวลึกลับหรือสืบสวน ใช้เวลาเลือกหนังหรือซีรีส์ ตัวอย่างประโยค: ",
          "language": "th"
        },
        {
          "text": "Let's watch a mystery tonight.",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "เสริมคลังคำศัพท์แนวภาพยนตร์เพื่อชวนเพื่อนเลือกหนังในไทย",
      "screenElement": "vocabulary_card",
      "vocabWord": "mystery",
      "visualDescription": "Movie genre icons with a magnifying glass representing the mystery genre.",
      "backgroundImageDescription": "Cinema lobby at CentralWorld with glowing movie posters, Thai and English titles visible, couples buying tickets at a counter."
    },
    {
      "id": "grammar_present_simple",
      "text": "ไวยากรณ์: Present Simple ใช้บอกนิสัย ความจริงทั่วไป และความชอบ โครงสร้างคือประธาน + กริยาช่อง 1 ถาม-ปฏิเสธใช้ do/does ตัวอย่างประโยค: Do you eat fish? และ My wife likes spicy food but I do not. รวมถึง I prefer short books.",
      "textParts": [
        {
          "text": "ไวยากรณ์: Present Simple ใช้บอกนิสัย ความจริงทั่วไป และความชอบ โครงสร้างคือประธาน + กริยาช่อง 1 ถาม-ปฏิเสธใช้ do/does ตัวอย่างประโยค: ",
          "language": "th"
        },
        {
          "text": "Do you eat fish?",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " และ ",
          "language": "th"
        },
        {
          "text": "My wife likes spicy food but I do not.",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " รวมถึง ",
          "language": "th"
        },
        {
          "text": "I prefer short books.",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "สรุปการใช้ Present Simple พร้อมตัวอย่างประโยคสั้นชัดเพื่อพูดถึงนิสัยและความชอบ",
      "screenElement": "grammar_card",
      "visualDescription": "Whiteboard graphic showing subject + base verb, with simple arrows for questions using do/does.",
      "backgroundImageDescription": "Quiet study corner in a Thai university library, whiteboard with handwritten grammar notes, Thai-English labels on sticky notes."
    },
    {
      "id": "grammar_present_continuous",
      "text": "ไวยากรณ์: Present Continuous ใช้ be + V-ing เพื่อบอกสิ่งที่กำลังเกิดขึ้นตอนนี้ หรือสถานการณ์ชั่วคราว ตัวอย่างที่ได้ยินบ่อยคือ Are you enjoying your stay at our hotel? และ My wife and I are having a great time. อีกตัวอย่างคือ What kind of book are you looking for?",
      "textParts": [
        {
          "text": "ไวยากรณ์: Present Continuous ใช้ be + V-ing เพื่อบอกสิ่งที่กำลังเกิดขึ้นตอนนี้ หรือสถานการณ์ชั่วคราว ตัวอย่างที่ได้ยินบ่อยคือ ",
          "language": "th"
        },
        {
          "text": "Are you enjoying your stay at our hotel?",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " และ ",
          "language": "th"
        },
        {
          "text": "My wife and I are having a great time.",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " อีกตัวอย่างคือ ",
          "language": "th"
        },
        {
          "text": "What kind of book are you looking for?",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "ชี้จุดเด่นของรูปกำลังกระทำ พร้อมตัวอย่างคำถาม-คำตอบที่ใช้ได้จริง",
      "screenElement": "grammar_card",
      "visualDescription": "Animated timeline highlighting the “now” point, with verbs changing to -ing form on screen.",
      "backgroundImageDescription": "Hotel lobby in Bangkok with Thai staff at reception, guests checking in; bookstore corner with Thai and English signs nearby."
    },
    {
      "id": "grammar_modals",
      "text": "ไวยากรณ์: Modals สำหรับการขอร้อง เสนอ หรือขออนุญาต ใช้ can, may, would + กริยาช่อง 1 เพื่อความสุภาพ ตัวอย่างประโยค: Can you recommend a nice restaurant? และ May we please have a table for two? รวมถึง Would you also like to add a salad on the side, sir?",
      "textParts": [
        {
          "text": "ไวยากรณ์: Modals สำหรับการขอร้อง เสนอ หรือขออนุญาต ใช้ can, may, would + กริยาช่อง 1 เพื่อความสุภาพ ตัวอย่างประโยค: ",
          "language": "th"
        },
        {
          "text": "Can you recommend a nice restaurant?",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " และ ",
          "language": "th"
        },
        {
          "text": "May we please have a table for two?",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " รวมถึง ",
          "language": "th"
        },
        {
          "text": "Would you also like to add a salad on the side, sir?",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "อธิบายการใช้ modal verbs เพื่อสื่อสารอย่างสุภาพในสถานการณ์กินข้าวและบริการ",
      "screenElement": "grammar_card",
      "visualDescription": "Polite speech bubbles with highlighted modal words can, may, would.",
      "backgroundImageDescription": "Cozy Thai restaurant in Bangkok with wooden decor, wai greeting sign at the entrance, server holding menus with Thai-English print."
    },
    {
      "id": "practice_coffee",
      "text": "มาฝึกพูดสถานการณ์สั่งกาแฟนะ จินตนาการว่าอยู่หน้าเคาน์เตอร์ ฟังแล้วพูดตามชัดๆ เว้นจังหวะนิดหนึ่งเพื่อความสุภาพ เริ่มเลย: Can I get a medium latte with oat milk, please? ต่อด้วยขอหวานน้อย: Less sugar, please. ถามยอดรวมภาษี: How much is it with tax? บอกการจ่ายเงิน: I'd like to pay by credit card. ขอสะสมแต้ม: Can you add my phone number for points?",
      "textParts": [
        {
          "text": "มาฝึกพูดสถานการณ์สั่งกาแฟนะ จินตนาการว่าอยู่หน้าเคาน์เตอร์ ฟังแล้วพูดตามชัดๆ เว้นจังหวะนิดหนึ่งเพื่อความสุภาพ เริ่มเลย: ",
          "language": "th"
        },
        {
          "text": "Can I get a medium latte with oat milk, please?",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " ต่อด้วยขอหวานน้อย: ",
          "language": "th"
        },
        {
          "text": "Less sugar, please.",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " ถามยอดรวมภาษี: ",
          "language": "th"
        },
        {
          "text": "How much is it with tax?",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " บอกการจ่ายเงิน: ",
          "language": "th"
        },
        {
          "text": "I'd like to pay by credit card.",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " ขอสะสมแต้ม: ",
          "language": "th"
        },
        {
          "text": "Can you add my phone number for points?",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "ซ้อมพูด 5 ประโยคสำคัญในการสั่งกาแฟ ปรับแต่งรสชาติ ถามภาษี จ่ายบัตร และสะสมแต้ม",
      "screenElement": "practice_card",
      "visualDescription": "Step-by-step prompts above a coffee counter illustration; each phrase appears with a gentle ping.",
      "backgroundImageDescription": "Starbucks-style counter near Siam BTS with Thai barista, milk alternatives listed in Thai, small sign for VAT receipt, card machine ready for tap to pay."
    },
    {
      "id": "practice_routine",
      "text": "คราวนี้ฝึกคุยกับเพื่อนเรื่องกิจวัตร ลองพูดถาม-ตอบสั้นๆ ตามครูนะ เริ่มถาม: What's your daily routine? ตอบแบบทั่วไป: I usually wake up at 6 a.m. เพิ่มการเดินทางไปเรียน: I take the BTS to Chulalongkorn. ขอคำแนะนำ: Any advice for better sleep? ปิดท้ายตอบรับ: Thanks, I'll try.",
      "textParts": [
        {
          "text": "คราวนี้ฝึกคุยกับเพื่อนเรื่องกิจวัตร ลองพูดถาม-ตอบสั้นๆ ตามครูนะ เริ่มถาม: ",
          "language": "th"
        },
        {
          "text": "What's your daily routine?",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " ตอบแบบทั่วไป: ",
          "language": "th"
        },
        {
          "text": "I usually wake up at 6 a.m.",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " เพิ่มการเดินทางไปเรียน: ",
          "language": "th"
        },
        {
          "text": "I take the BTS to Chulalongkorn.",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " ขอคำแนะนำ: ",
          "language": "th"
        },
        {
          "text": "Any advice for better sleep?",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " ปิดท้ายตอบรับ: ",
          "language": "th"
        },
        {
          "text": "Thanks, I'll try.",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "บทฝึกถาม-ตอบกิจวัตรตอนเช้าพร้อมขอคำแนะนำเรื่องการนอนและการเดินทาง",
      "screenElement": "practice_card",
      "visualDescription": "Dialogue bubbles appear in sequence with a small alarm clock and BTS train icons.",
      "backgroundImageDescription": "Thammasat Tha Prachan riverside walkway at golden hour; students chatting near Chao Phraya River, ferry and BTS map sign visible."
    },
    {
      "id": "practice_grocery",
      "text": "สถานการณ์ซูเปอร์มาร์เก็ตที่ Big C ลองถามพนักงานและแคชเชียร์เป็นภาษาอังกฤษนะ เริ่มถามหาสินค้า: Where can I find almond milk? ถามว่ามีสินค้าที่ต้องการไหม: Do you have fat-free yogurt? ตอนคิดเงินถามยอดสุทธิรวมภาษี: How much is the total with tax?",
      "textParts": [
        {
          "text": "สถานการณ์ซูเปอร์มาร์เก็ตที่ Big C ลองถามพนักงานและแคชเชียร์เป็นภาษาอังกฤษนะ เริ่มถามหาสินค้า: ",
          "language": "th"
        },
        {
          "text": "Where can I find almond milk?",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " ถามว่ามีสินค้าที่ต้องการไหม:  ",
          "language": "th"
        },
        {
          "text": "Do you have fat-free yogurt?",
          "language": "en",
          "speakingRate": 0.8
        },
        {
          "text": " ตอนคิดเงินถามยอดสุทธิรวมภาษี: ",
          "language": "th"
        },
        {
          "text": "How much is the total with tax?",
          "language": "en",
          "speakingRate": 0.8
        }
      ],
      "description": "ซ้อมบทสนทนาในซูเปอร์ ตั้งแต่ถามหาของสุขภาพจนถึงถามยอดรวมภาษีที่แคชเชียร์",
      "screenElement": "practice_card",
      "visualDescription": "Checklist overlay on a supermarket aisle; each phrase appears as the camera pans to the dairy section and checkout.",
      "backgroundImageDescription": "Big C Ratchadamri interior with dairy refrigerators full of almond milk and yogurt; Thai cashier at a bright checkout counter with a VAT receipt printer."
    },
    {
      "id": "conclusion",
      "text": "เก่งมากค่ะ วันนี้คุณได้ฝึกสั่งกาแฟอย่างมืออาชีพ ซื้อของสุขภาพในซูเปอร์ และคุยเรื่องกิจวัตรเพื่อสุขภาพ ต่อจากนี้ลองใช้ประโยคที่เรียนวันนี้กับร้านจริงหรือเพื่อนในมหาลัยนะ แล้วกลับมาทวนอีกครั้งเพื่อความคล่องตัว เจอกันบทเรียนถัดไปค่ะ",
      "textParts": [
        {
          "text": "เก่งมากค่ะ วันนี้คุณได้ฝึกสั่งกาแฟอย่างมืออาชีพ ซื้อของสุขภาพในซูเปอร์ และคุยเรื่องกิจวัตรเพื่อสุขภาพ ต่อจากนี้ลองใช้ประโยคที่เรียนวันนี้กับร้านจริงหรือเพื่อนในมหาลัยนะ แล้วกลับมาทวนอีกครั้งเพื่อความคล่องตัว เจอกันบทเรียนถัดไปค่ะ",
          "language": "th"
        }
      ],
      "description": "สรุปประเด็นสำคัญและชวนผู้เรียนลองใช้จริง พร้อมให้กำลังใจ",
      "screenElement": "conclusion_card",
      "visualDescription": "Closing screen with a friendly thumbs-up icon and a short recap list fading in.",
      "backgroundImageDescription": "Evening view of BTS Skytrain gliding past Siam area, warm city lights, students walking with coffee cups and grocery bags, calm and positive atmosphere."
    }
  ]
}