{
  "flashcards": [
    {
      "word": "section",
      "definition": "a distinct part or division of something, such as a store, document, or area",
      "thaiDefinition": "ส่วนที่แบ่งออกจากทั้งหมดอย่างชัดเจน เช่น แผนกในห้างสรรพสินค้า หมวดในหนังสือ หรือโซนพื้นที่ที่จัดไว้เฉพาะ",
      "thaiTranslation": "แผนก/โซน",
      "pronunciation": "เซค-ชั่น",
      "phonetic": "/ˈsek.ʃən/",
      "memoryHook": "เซค-ชั่น นึกถึงป้ายใหญ่ใน Big C ที่เขียนว่า “Section A/B” เวลาเราหาโซนผลไม้หรือโซนขนม จะจำได้ว่า section = โซน/แผนก",
      "contextExample": "Let's meet at the fruit section in Big C Ratchadamri. - นัดเจอกันที่โซนผลไม้ใน Big C ราชดำริ",
      "partOfSpeech": "noun",
      "difficulty": "medium"
    },
    {
      "word": "mystery",
      "definition": "a genre or situation that involves something unknown or hard to explain, often about solving a crime",
      "thaiDefinition": "แนวเรื่องหรือสถานการณ์ที่มีปริศนา ไม่ชัดเจน ต้องสืบหาความจริง มักเกี่ยวกับการไขคดีหรือเฉลยปม",
      "thaiTranslation": "เรื่องลึกลับ",
      "pronunciation": "มิส-เตอ-รี่",
      "phonetic": "/ˈmɪs.tə.ri/",
      "memoryHook": "มิส-เตอ-รี่ ฟังเหมือน “มิสเตอร์ลี้” คนลึกลับในย่านเยาวราช เดินผ่านแล้วชวนสงสัย—จำว่า mystery = ลึกลับชวนสืบ",
      "contextExample": "I found a Thai mystery novel at Kinokuniya in CentralWorld. - ฉันเจอนิยายสืบสวนของไทยที่ร้านคิโนะคุนิยะใน CentralWorld",
      "partOfSpeech": "noun",
      "difficulty": "medium"
    },
    {
      "word": "romance",
      "definition": "a genre or feeling centered on love and romantic relationships",
      "thaiDefinition": "แนวเรื่องหรือความรู้สึกที่เน้นความรัก ความสัมพันธ์โรแมนติก ระหว่างตัวละครหรือคู่รัก",
      "thaiTranslation": "รักโรแมนติก",
      "pronunciation": "โร-แมนซ์",
      "phonetic": "/roʊˈmæns/",
      "memoryHook": "โร-แมนซ์ นึกถึงคู่รักถ่ายรูปพระอาทิตย์ตกริมแม่น้ำเจ้าพระยาที่ ICONSIAM บรรยากาศโรแมนติกมาก",
      "contextExample": "She prefers romance movies when we go to SF Cinema at CentralWorld. - เวลาไปดูหนังที่ SF CentralWorld เธอจะชอบหนังรักโรแมนติก",
      "partOfSpeech": "noun",
      "difficulty": "easy"
    },
    {
      "word": "routine",
      "definition": "a regular way of doing things; a set of actions you do every day",
      "thaiDefinition": "ชุดกิจกรรมที่ทำเป็นประจำ ซ้ำๆ มีลำดับเดิมในชีวิตประจำวัน เช่น ตื่น แปรงฟัน เดินทางไปเรียน",
      "thaiTranslation": "กิจวัตรประจำวัน",
      "pronunciation": "รู-ทีน",
      "phonetic": "/ruːˈtiːn/",
      "memoryHook": "รู-ทีน นึกถึง “รูทางเดิมๆ” เช้าๆ ลง BTS ชิดลม แล้วแวะ TRUE Coffee ก่อนเข้าเรียน เป็นทางเดิมที่ทำทุกวัน",
      "contextExample": "My morning routine is to take the BTS from Mo Chit to Siam and grab coffee at TRUE Coffee. - กิจวัตรตอนเช้าของฉันคือขึ้น BTS จากหมอชิตไปสยามแล้วแวะกินกาแฟที่ TRUE Coffee",
      "partOfSpeech": "noun",
      "difficulty": "medium"
    },
    {
      "word": "alarm",
      "definition": "a device or signal that warns you or wakes you up",
      "thaiDefinition": "อุปกรณ์หรือสัญญาณเตือน ใช้ปลุกให้ตื่นหรือตั้งเตือนเวลาเหตุฉุกเฉินหรือสิ่งที่ต้องทำ",
      "thaiTranslation": "นาฬิกาปลุก",
      "pronunciation": "อะ-ลาม",
      "phonetic": "/əˈlɑːrm/",
      "memoryHook": "อะ-ลาม นึกภาพเสียงปลุกดังจนสะดุ้งว่า “อ๊ะ!” แล้วรีบลุก—alarm = เสียงปลุกให้ตื่น",
      "contextExample": "I set my alarm for 6:30 a.m. to catch the BTS to Chulalongkorn University. - ฉันตั้งนาฬิกาปลุก 6:30 เพื่อไปขึ้น BTS ไปจุฬาฯ",
      "partOfSpeech": "noun",
      "difficulty": "easy"
    },
    {
      "word": "snooze",
      "definition": "to delay an alarm or to sleep lightly for a short time",
      "thaiDefinition": "กดเลื่อนเวลาปลุกออกไปชั่วคราว หรือการงีบหลับสั้นๆ ก่อนตื่นจริง",
      "thaiTranslation": "เลื่อนปลุก",
      "pronunciation": "ส-นูซ",
      "phonetic": "/snuːz/",
      "memoryHook": "ส-นูซ นึกถึง “หนูงีบ” กดปุ่ม Snooze บนมือถือแล้วนอนต่ออีก 5–10 นาที",
      "contextExample": "I snoozed my alarm three times and almost missed the BTS to Siam. - ฉันกดเลื่อนปลุกสามรอบจนเกือบตกรถไฟฟ้าไปสยาม",
      "partOfSpeech": "verb",
      "difficulty": "medium"
    },
    {
      "word": "skip",
      "definition": "to not do something; to pass over or omit",
      "thaiDefinition": "ข้ามหรือเว้นไม่ทำสิ่งหนึ่งสิ่งใด เช่น ข้ามมื้ออาหาร ข้ามขั้นตอน หรือกดข้าม",
      "thaiTranslation": "ข้าม",
      "pronunciation": "สกิพ",
      "phonetic": "/skɪp/",
      "memoryHook": "สกิพ ให้นึกถึงปุ่ม “Skip Ads” บน YouTube ที่กดข้ามโฆษณา—จำว่า skip = ข้าม",
      "contextExample": "I decided to skip fast food at MBK and eat khao man gai in Samyan instead. - ฉันตัดสินใจไม่กินฟาสต์ฟู้ดที่ MBK ไปกินข้าวมันไก่ที่สามย่านแทน",
      "partOfSpeech": "verb",
      "difficulty": "easy"
    },
    {
      "word": "fast food",
      "definition": "food that is prepared and served quickly, often from chain restaurants",
      "thaiDefinition": "อาหารที่ทำและเสิร์ฟรวดเร็ว มักเป็นร้านเชน เช่น เบอร์เกอร์ ไก่ทอด พิซซ่า สะดวกแต่บางครั้งมีไขมัน/โซเดียมสูง",
      "thaiTranslation": "อาหารจานด่วน",
      "pronunciation": "ฟาสต์-ฟู้ด",
      "phonetic": "/ˌfæst ˈfuːd/",
      "memoryHook": "ฟาสต์-ฟู้ด นึกถึงรีบกินเบอร์เกอร์ก่อนขึ้น BTS ที่สถานีอโศก เวลามีนัดเรียนเร็ว",
      "contextExample": "We grabbed fast food at McDonald's near BTS Asok before class. - พวกเราซื้อฟาสต์ฟู้ดที่แมคฯ ใกล้ BTS อโศกก่อนเข้าเรียน",
      "partOfSpeech": "noun",
      "difficulty": "easy"
    },
    {
      "word": "healthy",
      "definition": "good for your body and mind; promoting good health",
      "thaiDefinition": "ดีต่อสุขภาพ ช่วยให้ร่างกายแข็งแรง จิตใจสดใส ลดความเสี่ยงต่อโรค",
      "thaiTranslation": "ดีต่อสุขภาพ",
      "pronunciation": "เฮล-ธี",
      "phonetic": "/ˈhel.θi/",
      "memoryHook": "เฮล-ธี ฟังเหมือน “เฮลธ์ดี” นึกถึงกินสลัดชามโตแล้วไปวิ่งที่สวนลุม—รู้สึกเฮลธ์ดีจริงๆ",
      "contextExample": "I try to choose healthy options like salad bowls at CentralWorld Food Hall. - ฉันพยายามเลือกเมนูที่ดีต่อสุขภาพอย่างสลัดโบวล์ที่ฟู้ดฮอลล์ CentralWorld",
      "partOfSpeech": "adjective",
      "difficulty": "easy"
    }
  ]
}