{
  "lesson": {
    "title": "Daily Living: Coffee, Groceries, and Healthy Routines",
    "titleTh": "Daily Living: Coffee, Groceries, and Healthy กิจวัตร",
    "duration": 960,
    "learningObjectives": [
      {
        "statement": "ฝึกใช้ 'Can I get ...?' เพื่อสั่งกาแฟ เลือกขนาด/นม จ่ายเงิน และสะสมแต้มในร้านกาแฟจริงในไทย",
        "statementTh": "เรียนรู้การสื่อสารภาษาอังกฤษเชิงปฏิบัติสำหรับการสั่งกาแฟและชำระเงินในบริบทไทย",
        "stepByStepExplanation": [
          "1. เริ่มคำสั่งอย่างสุภาพด้วย 'Can I get a [size] [drink] with [milk option], please?' ระบุขนาด เช่น small, medium, large และประเภทนม เช่น regular, skim, fat-free, almond, soy, oat",
          "2. ใส่เงื่อนไขด้านสุขภาพได้ เช่น ขอหวานน้อยหรือไม่ใส่น้ำเชื่อม โดยพูดเพิ่ม 'less sugar' หรือ 'no syrup' เพื่อให้เครื่องดื่มเหมาะกับเป้าหมายสุขภาพ",
          "3. ตรวจราคารวมภาษีด้วยคำถาม 'How much is it with tax?' เพื่อเข้าใจยอดชำระจริงก่อนจ่าย",
          "4. แจ้งวิธีชำระเงินแบบชัดเจน 'I'd like to pay by credit card.' หรือยื่นบัตร/แตะบัตรแบบ contactless ตามที่ร้านรองรับ",
          "5. สะสมแต้มด้วยเบอร์โทรและรู้จุดรับเครื่องดื่ม โดยพูด 'Can you add my phone number for points?' และถามทางรับเครื่องดื่ม 'Where do I pick up my order?' หากไม่แน่ใจ"
        ],
        "thaiContextExamples": [
          {
            "englishPhrase": "Can I get a medium latte with oat milk, please?",
            "thaiContext": "ที่ Starbucks Siam นักศึกษาขอ 'ลาเต้ ขนาดกลาง ใส่นมโอ๊ต' เพื่อลดนมวัวและควบคุมแคลอรี",
            "situation": "ยืนหน้าเคาน์เตอร์ สั่งเมนูตามแถบขนาดและตัวเลือกนม",
            "memoryHook": "จำว่า Can I get = ขอได้ไหม, เติม please ท้ายประโยคให้สุภาพ",
            "pronunciation": "แคน ไอ เก็ต อะ มีเดียม ลา-เต้ วิธ โอ๊ต มิลก์ พลีส"
          },
          {
            "englishPhrase": "How much is it with tax?",
            "thaiContext": "ที่ TRUE Coffee ใกล้จุฬาฯ อยากรู้ยอดสุทธิรวมภาษีก่อนแตะบัตร",
            "situation": "หลังพนักงานบอกราคาเบื้องต้น ขอให้คำนวณรวมภาษี",
            "memoryHook": "with tax = รวมภาษีแล้ว, ใช้ถามก่อนจ่ายจะชัวร์",
            "pronunciation": "ฮาว มัช อิส อิท วิธ แท็กซ์"
          },
          {
            "englishPhrase": "Can you add my phone number for points?",
            "thaiContext": "ที่ Café Amazon สถานี BTS หมอชิต ขอสะสมแต้มด้วยเบอร์โทร ก่อนรอรับแก้วที่จุดรับ",
            "situation": "แจ้งหมายเลขโทรศัพท์ให้พนักงานก่อนชำระเงิน",
            "memoryHook": "add my phone number = เพิ่มเบอร์ฉัน, for points = เพื่อสะสมแต้ม",
            "pronunciation": "แคน ยู แอด มาย โฟน นัมเบอร์ ฟอร์ พอยน์ทส์"
          }
        ],
        "memoryHooks": [
          "นึกเป็นสูตร: Can I get + ขนาด + เครื่องดื่ม + with + ชนิดนม + please",
          "สุขภาพจำง่าย: skim/fat-free = ไขมันต่ำ, almond/soy/oat = ทางเลือก plant-based",
          "ขั้นตอนเงิน: ถามราคารวมภาษี → สะสมแต้ม → จ่ายบัตร → ไปรับที่จุด pick-up"
        ],
        "summaryPoints": [
          "ใช้ 'Can I get ...?' เป็นประโยคหลักในการสั่งและปรับแต่ง",
          "ถามยอดสุทธิด้วย 'How much is it with tax?' ก่อนจ่าย",
          "แจ้งการจ่ายบัตรสั้นๆว่า 'I'd like to pay by credit card.'",
          "ขอสะสมแต้มด้วย 'Can you add my phone number for points?' แล้วไปจุดรับตามที่พนักงานบอก"
        ]
      },
      {
        "statement": "ฝึกถาม–ตอบด้วย 'What's your daily routine?' และตอบด้วย 'I usually ...' เพื่อเล่าเวลาตื่น นาฬิกาปลุก การเดินทาง และนิสัยสุขภาพ",
        "statementTh": "พัฒนาทักษะการบรรยายตารางชีวิตประจำวัน การจัดการเวลาเช้า และการขอคำแนะนำสุขภาพ",
        "stepByStepExplanation": [
          "1. เปิดบทสนทนาด้วยคำถาม 'What's your daily routine?' เพื่อชวนคุยเรื่องตารางชีวิต",
          "2. ตอบด้วยแม่แบบ 'I usually + กริยา + เวลา' เช่น 'I usually wake up at 6 a.m.' ใส่รายละเอียด alarm, snooze ได้",
          "3. เน้นสุขภาพตอนเช้า: กล่าวหลีกเลี่ยงการ skip มื้อเช้า เลือกอาหาร healthy แทน fast food และวางแผน meal prep",
          "4. บอกการเดินทางและออกกำลังกาย เช่น 'I take the BTS to Chulalongkorn.' หรือ 'I walk 20 minutes.' เพื่อสื่อสารการคุมเวลาและการเคลื่อนไหว",
          "5. ขอและให้คำแนะนำอย่างสุภาพด้วย 'Any advice for ...?' และตอบรับ 'Thanks, I'll try.' เพื่อฝึกให้คำแนะนำและยอมรับคำแนะนำ"
        ],
        "thaiContextExamples": [
          {
            "englishPhrase": "What's your daily routine?",
            "thaiContext": "ที่มหาวิทยาลัยธรรมศาสตร์ ท่าพระจันทร์ ชวนเพื่อนคุยฝึกพูดถึงกิจวัตรประจำวันก่อนนั่ง MRT กลับบ้าน",
            "situation": "เริ่มบทสนทนาหลังเลิกคลาสเพื่อแลกเปลี่ยนเคล็ดลับการจัดการเวลา",
            "memoryHook": "daily routine = กิจวัตรประจำวัน, ใช้ถามเพื่อฝึก Q&A",
            "pronunciation": "ว็อตส์ ยัวร์ เดลี่ รูทีน"
          },
          {
            "englishPhrase": "I usually wake up at 6 a.m.",
            "thaiContext": "นักศึกษามหิดล เล่าให้เพื่อนฟังว่าเซ็ต alarm แต่บางทีเผลอกด snooze แล้วรีบขึ้นรถตู้ไปศาลายา",
            "situation": "ตอบคำถามเรื่องเวลาตื่นและปัญหา snooze พร้อมแผนแก้",
            "memoryHook": "I usually = ฉันมักจะ, เติมเวลา at 6 a.m. ให้ชัด",
            "pronunciation": "ไอ ยูชวลลี เวค อัป แอท ซิกซ์ เอ-เอ็ม"
          },
          {
            "englishPhrase": "Any advice for better sleep?",
            "thaiContext": "นิสิตเกษตรศาสตร์ที่พักแถวแยกเกษตร ขอคำแนะนำจากเพื่อนเรื่องนอนเร็ว ไม่ skip มื้อเช้า และเลือก healthy ที่ 7-Eleven แทน fast food ก่อนขึ้น BTS",
            "situation": "ปิดบทสนทนาด้วยการขอคำแนะนำและสรุปแผนปรับพฤติกรรม",
            "memoryHook": "Any advice for ...? = ขอคำแนะนำเรื่อง..., ตามด้วยหัวข้อที่ต้องการ",
            "pronunciation": "เอนนี แอดไวซ์ ฟอร์ เบทเทอร์ สลีป"
          }
        ],
        "memoryHooks": [
          "โครงสร้างตอบเร็ว: I usually + กริยา + เวลา เช่น wake up, go to bed, take the BTS",
          "คำคู่จำง่าย: alarm = นาฬิกาปลุก, snooze = เลื่อนปลุก, skip = ข้าม, fast food ↔ healthy",
          "จับเวลาเช้าเป็นบล็อก: ตื่น → ออกกำลังสั้นๆ → อาหารเช้า → เดินทาง BTS/MRT/Grab"
        ],
        "summaryPoints": [
          "ใช้ 'What's your daily routine?' เปิดบทสนทนาเรื่องชีวิตประจำวัน",
          "ตอบด้วยรูปแบบ 'I usually ...' เพื่อเล่าเวลาและนิสัยสำคัญ",
          "ใส่คำศัพท์เป้าหมาย: routine, alarm, snooze, skip, fast food, healthy ให้ครบ",
          "ปิดด้วยการขอคำแนะนำ 'Any advice for ...?' และตอบรับ 'Thanks, I'll try.' เพื่อพัฒนาทักษะให้-รับคำแนะนำ"
        ]
      }
    ],
    "keyVocabulary": [
      {
        "word": "section",
        "thaiTranslation": "แผนก/หมวด/โซน",
        "memoryHook": "section อ่านว่า เซค-ชั่น ให้นึกถึงโซนในห้าง เช่น เซคชั่นผัก เซคชั่นนม เวลาเดิน Central World จะเห็นป้ายแบ่งโซนชัดๆ",
        "contextExample": "The dairy section is next to the produce section. - ที่ Big C ฉันจะไปแผนกนมที่อยู่ติดกับโซนผัก เพื่อเลือกนมอัลมอนด์กับชีส แล้วเปรียบเทียบโปรไม่ให้ซื้อเกิน"
      },
      {
        "word": "mystery",
        "thaiTranslation": "แนวลึกลับ/สืบสวน",
        "memoryHook": "mystery ฟังเหมือน “มีสตอรี่” คือมีเรื่องราวให้ตามหาความจริง ลึกลับน่าค้นหา",
        "contextExample": "Let's watch a mystery tonight. - ไปดูหนังที่ Central World แล้วคุยกันเลือกแนวลึกลับก่อนซื้อตั๋วด้วยบัตรเครดิตและเก็บพอยต์"
      },
      {
        "word": "romance",
        "thaiTranslation": "แนวรักโรแมนติก",
        "memoryHook": "romance (โรแมนซ์) นึกถึงบรรยากาศโรแมนติก ดอกกุหลาบ เทียนหอม เวลาเดต",
        "contextExample": "We chose a romance for date night. - กินของหวานที่ After You แล้วไปซื้อตั๋วหนังแนวรักโรแมนติกที่ Central World ต่อ"
      },
      {
        "word": "routine",
        "thaiTranslation": "กิจวัตรประจำวัน",
        "memoryHook": "routine เสียงคล้าย “โรตีน” ให้นึกภาพกินโรตีทุกเช้าเป็นกิจวัตร ช่วยจำคำว่ากิจวัตร",
        "contextExample": "My morning routine helps me save time. - เช้าๆ ฉันแวะ TRUE Coffee สั่งลาเต้นมไขมัน 0% แล้วขึ้น BTS ไป Siam เข้าเรียนที่ Chula ทันเวลา"
      },
      {
        "word": "alarm",
        "thaiTranslation": "นาฬิกาปลุก",
        "memoryHook": "alarm ฟังเหมือนเสียง “อะ-ลาม!” ดังจนสะดุ้ง ตื่นแน่ๆ นึกถึงเสียงปลุกในมือถือ",
        "contextExample": "Set an alarm for 6:00 a.m. - ตั้งนาฬิกาปลุกตีหกเพื่อเตรียมอาหารเช้าเพื่อสุขภาพ แล้วออกเดินทางไปเรียนที่ Mahidol ให้ทัน"
      },
      {
        "word": "snooze",
        "thaiTranslation": "เลื่อนปลุก/งีบต่อ",
        "memoryHook": "snooze (สหนูส) นึกถึง “หนุนหมอนต่อ” กดเลื่อนปลุกแล้วนอนงีบอีกนิด",
        "contextExample": "Don't hit snooze three times. - ถ้ากดเลื่อนปลุกซ้ำๆ จะไปรับกาแฟที่สั่งล่วงหน้าที่ Café Amazon ไม่ทัน และอาจตก BTS รอบไป Siam"
      },
      {
        "word": "skip",
        "thaiTranslation": "ข้าม/เว้น",
        "memoryHook": "skip (สกิป) เหมือนกดปุ่มข้ามโฆษณา หรือกระโดดข้ามเชือก = ไม่ทำ/ไม่กินสิ่งนั้น",
        "contextExample": "I'll skip fast food tonight. - เย็นนี้จะเว้นอาหารจานด่วนที่ Terminal 21 Food Court แล้วแวะ Lotus ซื้อผัก ผลไม้ และไข่ (ระวังไข่แตก) แทน"
      },
      {
        "word": "fast food",
        "thaiTranslation": "อาหารจานด่วน",
        "memoryHook": "fast = เร็ว food = อาหาร นึกถึงไก่ทอด เบอร์เกอร์ ได้เร็วกว่าอาหารตามสั่ง แต่ไม่ค่อยดีต่อสุขภาพ",
        "contextExample": "Fast food is convenient but not always healthy. - ตอนเที่ยงที่ 7-Eleven สะดวกมาก แต่ฉันพยายามเลือกเมนูแคลอรี่ต่ำและนมไขมัน 0% แทนน้ำอัดลม"
      },
      {
        "word": "healthy",
        "thaiTranslation": "ดีต่อสุขภาพ",
        "memoryHook": "healthy (เฮลท์ตี้) ฮิตในไทย นึกถึงสลัด นมอัลมอนด์ โยเกิร์ตไขมัน 0% เลือกแบบที่ดีต่อสุขภาพ",
        "contextExample": "Almond milk is a healthy option for my iced coffee. - ที่ TRUE Coffee ฉันสั่งลาเต้เย็นนมอัลมอนด์ จ่ายด้วยบัตรเครดิต แล้วใส่เบอร์โทรสะสมพอยต์ก่อนรอรับเครื่องดื่ม"
      }
    ],
    "grammarPoints": [
      {
        "structure": "Present Simple for habits, facts, and preferences",
        "explanation": "Used to talk about routines, general truths, and likes/dislikes.",
        "thaiExplanation": "ใช้ช่อง V1 เพื่อบอกนิสัย ข้อเท็จจริง และความชอบ เช่น I like…, She works…, Do you…?",
        "examples": [
          "Do you eat fish?",
          "My wife likes spicy food but I do not.",
          "I prefer short books."
        ]
      },
      {
        "structure": "Present Continuous (be + V-ing)",
        "explanation": "Describes actions happening now, around now, or temporary situations.",
        "thaiExplanation": "ใช้ be + V-ing เพื่อบอกสิ่งที่กำลังเกิดขึ้น/ช่วงเวลานี้ หรือสถานการณ์ชั่วคราว",
        "examples": [
          "Are you enjoying your stay at our hotel?",
          "My wife and I are having a great time.",
          "What kind of book are you looking for?"
        ]
      },
      {
        "structure": "Modals for requests/offers/permission (can, may, would)",
        "explanation": "Use modal + base verb to ask politely, make offers, or ask permission.",
        "thaiExplanation": "ใช้ can/may/would + V1 ในการขอร้อง เสนอ หรือขออนุญาตอย่างสุภาพ",
        "examples": [
          "Can you recommend a nice restaurant?",
          "May we please have a table for two?",
          "Would you also like to add a salad on the side, sir?"
        ]
      }
    ],
    "comprehensionQuestions": [
      {
        "question": "คุณจะสั่งอาหารที่ TRUE Coffee เป็นภาษาอังกฤษอย่างไร? ฝึกพูด: \"I'd like an iced latte, large, with oat milk, less sweet. How much is the total with tax? Can I pay by credit card?\"",
        "questionTh": "คุณจะสั่งกาแฟที่ TRUE Coffee โดยระบุขนาด การปรับแต่งนมและความหวาน พร้อมทั้งถามราคารวมภาษีและการจ่ายด้วยบัตรเครดิตได้อย่างไร?",
        "expectedAnswer": "I'd like an iced latte, large, with oat milk, less sweet. How much is the total with tax? Can I pay by credit card? - ประโยคแรกคือการสั่งเครื่องดื่ม ระบุขนาดแก้วและนมข้าวโอ๊ต พร้อมขอหวานน้อย ต่อมาถามราคารวมภาษี และสุดท้ายสอบถามว่าจ่ายด้วยบัตรเครดิตได้หรือไม่",
        "context": "สถานการณ์จริง: คุณอยู่ที่ TRUE Coffee สาขาสยามสแควร์วันตอนเช้า ต้องการลาเต้เย็นแก้วใหญ่ เลือกนมข้าวโอ๊ตเพื่อสุขภาพและน้ำตาลน้อย ต้องการทราบยอดชำระรวมภาษีมูลค่าเพิ่ม (VAT 7%) และอยากจ่ายด้วยบัตรเครดิต"
      },
      {
        "question": "คุณจะพูดอะไรเมื่อช้อปปิ้งที่ Big C? ฝึกพูด: \"Where can I find almond milk? Do you have fat-free yogurt? How much is the total with tax?\"",
        "questionTh": "เมื่อคุณไปซื้อของเพื่อสุขภาพที่ Big C คุณจะถามหานมอัลมอนด์ ถามว่าโยเกิร์ตไขมัน 0% มีไหม และถามยอดรวมภาษีที่แคชเชียร์อย่างไร?",
        "expectedAnswer": "Where can I find almond milk? Do you have fat-free yogurt? How much is the total with tax? - ใช้ถามพนักงานว่าชั้นวางนมอัลมอนด์อยู่ตรงไหน ถามว่ามีโยเกิร์ตไขมัน 0% หรือไม่ และสอบถามยอดรวมภาษีตอนคิดเงิน",
        "context": "สถานการณ์จริง: คุณอยู่ที่ Big C ราชดำริ ใกล้เซ็นทรัลเวิลด์ กำลังเลือกสินค้าสายสุขภาพ เช่น นมอัลมอนด์ โยเกิร์ตไขมัน 0% และอยากทราบยอดสุทธิรวม VAT ก่อนตัดสินใจชำระเงิน"
      },
      {
        "question": "คุณจะถามทางไป BTS สยามอย่างไร? ฝึกพูด: \"How do I get to BTS Siam?\"",
        "questionTh": "ถ้าคุณอยู่แถวสยามและอยากไปสถานีรถไฟฟ้า BTS สยาม คุณจะถามทางเป็นภาษาอังกฤษอย่างไร?",
        "expectedAnswer": "How do I get to BTS Siam? - เป็นประโยคสั้น กระชับ ใช้ถามทางไปสถานีบีทีเอสสยาม",
        "context": "สถานการณ์จริง: คุณยืนอยู่ที่หน้าห้างเซ็นทรัลเวิลด์และต้องการเดินหรือขึ้นสกายวอล์กไป BTS สยาม จึงถามเจ้าหน้าที่หรือคนท้องถิ่นเพื่อความแน่ใจ"
      },
      {
        "question": "คุณจะถามอะไรที่แผนกต้อนรับโรงแรม Novotel? ฝึกพูด: \"Do you have skim or soy milk at breakfast? Can I get a late checkout, please? Do you accept credit cards?\"",
        "questionTh": "เมื่อเช็คอินที่โรงแรม Novotel คุณจะสอบถามเรื่องตัวเลือกนมสำหรับมื้อเช้า ขอเลทเช็คเอาต์ และถามว่าสามารถจ่ายด้วยบัตรเครดิตได้ไหม อย่างไร?",
        "expectedAnswer": "Do you have skim or soy milk at breakfast? Can I get a late checkout, please? Do you accept credit cards? - ประโยคแรกถามตัวเลือกนมเพื่อสุขภาพ (นมพร่องมันเนย/นมถั่วเหลือง) สำหรับบุฟเฟต์เช้า ประโยคที่สองขอเลทเช็คเอาต์อย่างสุภาพ และประโยคที่สามสอบถามการรับบัตรเครดิต",
        "context": "สถานการณ์จริง: คุณพักที่ Novotel Bangkok on Siam Square ใกล้ BTS สยาม ต้องการนมพร่องมันเนยหรือนมถั่วเหลืองตอนอาหารเช้า วางแผนออกสาย และจะวางมัดจำหรือชำระค่าบริการด้วยบัตรเครดิต"
      },
      {
        "question": "คุณจะร้องเรียนเรื่องอาหารที่ Terminal 21 อย่างไร? ฝึกพูด: \"Excuse me, this chicken is undercooked. Could you please replace it? I'm allergic to nuts.\"",
        "questionTh": "หากคุณทานอาหารที่ Terminal 21 แล้วพบว่าไก่สุกไม่ทั่วถึง และคุณแพ้ถั่ว คุณจะร้องเรียนและขอเปลี่ยนจานอย่างไรเป็นภาษาอังกฤษ?",
        "expectedAnswer": "Excuse me, this chicken is undercooked. Could you please replace it? I'm allergic to nuts. - เรียกพนักงานอย่างสุภาพ แจ้งปัญหาอาหารสุกไม่พอ ขอเปลี่ยนใหม่ และแจ้งอาการแพ้ถั่วเพื่อความปลอดภัย",
        "context": "สถานการณ์จริง: คุณทานที่ Pier 21 Food Court ใน Terminal 21 อโศก แล้วพบว่าไก่ยังดิบและมีความเสี่ยงต่อสุขภาพ อีกทั้งคุณแพ้ถั่ว จึงจำเป็นต้องแจ้งพนักงานให้เปลี่ยนจานเพื่อความปลอดภัย"
      }
    ],
    "originalSegments": [
      "Coffee Ordering, Payment, and Loyalty Points",
      "Smart Grocery Shopping and Choosing Movie Genres",
      "Daily Routines and Healthier Habit Advice (+ Q&A Practice)"
    ]
  },
  "seriesInfo": {
    "seriesTitle": "Everyday English in Real Life: Dining, Errands, and Daily Habits",
    "seriesTitleTh": "หลักสูตรการเรียนภาษาอังกฤษ: Everyday English in Real Life: Dining, Errands, and Daily Habits",
    "episodeNumber": 3,
    "totalEpisodes": 3,
    "description": "Order coffee and handle payment and loyalty points, make smart quantity/price decisions at the grocery store, and describe daily routines while giving and accepting advice for healthier habits.",
    "descriptionTh": "Order coffee and handle payment and loyalty points, make smart quantity/price decisions at the grocery store, and describe กิจวัตรประจำวัน while giving and accepting advice for healthier habits."
  },
  "audioUrl": null
}