{
  "lesson": {
    "title": "Errands That Matter: Library and Bank Confidence",
    "titleTh": "Errands That Matter: Library and Bank Confidence",
    "duration": 660,
    "learningObjectives": [
      {
        "statement": "เรียนรู้การใช้ Could you recommend a good mystery book? ในสถานการณ์จริงในประเทศไทย",
        "statementTh": "ขอคำแนะนำหนังสือแนวนิยายสืบสวน พร้อมถามทางไปหมวดนิยายในห้องสมุด/ร้านหนังสือไทย และทำขั้นตอนยืมหนังสือ",
        "stepByStepExplanation": [
          "1. กำหนดความชอบก่อน: บอกแนวที่สนใจ เช่น ผจญภัย, แอ็กชัน, สืบสวน และบอกนักเขียนที่ชอบ เพื่อให้เจ้าหน้าที่แนะนำได้ตรงใจ",
          "2. แยกแยะว่าใครคือเจ้าหน้าที่: มองหาบัตรชื่อหรือยูนิฟอร์ม (เช่น เสื้อกั๊กหรือบัตรคล้องคอ) เพื่อไม่ไปถามลูกค้าคนอื่น",
          "3. ถามทางไปหมวดนิยาย/หมวดสืบสวน: หากอยู่ในห้องสมุด ให้ถามหาหมวดนิยายและชั้นวางที่เกี่ยวข้อง; หากเป็นร้านหนังสือ ให้ถามหาโซนนิยาย",
          "4. ประเมินความยาวและความสนใจ: ดูจำนวนหน้า ความหนา ตัวอย่างบทแรก ถ้าเริ่มต้นใหม่ให้เลือกเล่มสั้นเพื่อสร้างความมั่นใจ",
          "5. ขั้นตอนยืมและกำหนดคืน: ตรวจว่ามีบัตรห้องสมุดหรือยัง, ยืมหนังสือที่เคาน์เตอร์, เช็กวันที่ครบกำหนดคืนบนใบสลิป/ในระบบ; ถ้าเป็นร้านหนังสือให้ไปชำระเงินที่แคชเชียร์ (ไม่ใช่การยืม)"
        ],
        "thaiContextExamples": [
          {
            "englishPhrase": "Could you recommend a good mystery book?",
            "thaiContext": "ที่หอสมุดกลาง จุฬาลงกรณ์มหาวิทยาลัย เห็นบรรณารักษ์ติดบัตรชื่อ เดินไปใกล้ๆ แล้วขอคำแนะนำหนังสือสืบสวนอ่านสบายๆ ไม่ยาวมาก",
            "situation": "คุณอยากอ่านแนวสืบสวนหลังคลาส เริ่มจากเล่มไม่หนาเพื่อจบในหนึ่งสัปดาห์",
            "memoryHook": "คำว่า recommend จำว่า \"รี-คอม-เมนต์\" = ขอคำแนะนำแบบรีวิว",
            "pronunciation": "คุด ยู เรค-คะ-เมนดะ กูด มิส-เทอ-รี บุ๊ก?"
          },
          {
            "englishPhrase": "Where is the fiction section?",
            "thaiContext": "ที่ Central World ไปที่ร้านหนังสือแล้วมองหาเจ้าหน้าที่ที่มียูนิฟอร์ม ถามทางไปโซนนิยายเพื่อหาเล่มแนวผจญภัยหรือแอ็กชัน",
            "situation": "ต้องการเลือกนิยายแนวผจญภัยก่อนขึ้น BTS Skytrain กลับบ้าน",
            "memoryHook": "fiction section จำว่า \"ฟิก-ชั่น\" = นิยาย และ \"เซค-เชิน\" = โซน/แผนก",
            "pronunciation": "แวร์ อิซ เดอะ ฟิค-ชั่น เซค-เชิน?"
          },
          {
            "englishPhrase": "Can I check out this book?",
            "thaiContext": "ที่หอสมุด มหิดล เลือกหนังสือได้แล้ว เดินไปเคาน์เตอร์ยืม ขอทำรายการยืมและสอบถามวันครบกำหนดคืน",
            "situation": "ต้องการยืมหนังสืออ่านระหว่างนั่ง MRT และ Airport Rail Link ไปสนามบิน",
            "memoryHook": "check out จำว่า \"เช็ค-เอาต์\" = ทำรายการยืมออกจากห้องสมุด",
            "pronunciation": "แคน ไอ เช็ค เอาต์ ดิส บุ๊ก?"
          }
        ],
        "memoryHooks": [
          "นึกภาพป้ายโซนเป็นสี: นิยาย = สีฟ้า, สืบสวน = สีม่วง เพื่อจำคำว่า section/หมวด",
          "จำ 3 ขั้น: ถาม (recommend) → หาโซน (section) → ยืม (check out)",
          "สแกนเครื่องแบบ/บัตรชื่อก่อนถามเสมอ เพื่อไม่เผลอถามลูกค้าคนอื่น"
        ],
        "summaryPoints": [
          "บอกแนวที่ชอบและผู้แต่งที่สนใจเพื่อให้คำแนะนำตรงใจ",
          "แยกแยะเจ้าหน้าที่จากลูกค้าด้วยบัตรชื่อ/ยูนิฟอร์ม",
          "ถามทางไปหมวดนิยายและเลือกเล่มตามความยาวที่อ่านไหว",
          "ทำขั้นตอนยืมให้ครบและเช็กวันครบกำหนดคืนทุกครั้ง"
        ]
      },
      {
        "statement": "เรียนรู้การใช้ I'd like to deposit cash. ในสถานการณ์จริงในประเทศไทย",
        "statementTh": "สื่อสารที่ธนาคาร/ตู้ฝากเงินในห้างไทยเพื่อฝากเงินสด ขอใบเสร็จพร้อมยอดคงเหลือ และใช้บัตรกับรหัส PIN อย่างปลอดภัย",
        "stepByStepExplanation": [
          "1. เตรียมพร้อม: ตรวจจำนวนเงินสด เลขบัญชี และบัตรประชาชน (เผื่อธนาคารขอ) ก่อนออกจากบ้าน",
          "2. ระบุเจ้าหน้าที่: มองหาเคาน์เตอร์ที่มีป้ายธนาคารและพนักงานในยูนิฟอร์ม เพื่อไม่ไปถามลูกค้าท่านอื่น",
          "3. ฝากเงินที่เคาน์เตอร์: บอกความต้องการฝากเงินสด ชี้จำนวนเงิน ตรวจชื่อบัญชีก่อนยื่นเงิน",
          "4. ฝากเงินที่ตู้ฝากเงิน/ATM: ใส่บัตร ป้อนรหัส PIN โดยใช้มือบังแป้นพิมพ์ เลือกเมนูฝากเงินสด ใส่ธนบัตร ตรวจยอด",
          "5. ขอหลักฐานและตรวจสอบ: ขอพิมพ์ใบเสร็จที่มียอดคงเหลือ ตรวจชื่อ-เลขบัญชี-ยอดเงินให้ถูกต้อง แล้วเก็บใบเสร็จ"
        ],
        "thaiContextExamples": [
          {
            "englishPhrase": "I'd like to deposit cash.",
            "thaiContext": "ที่สาขาธนาคารใน Central World เดินไปที่พนักงานเคาน์เตอร์และบอกว่าต้องการฝากเงินสดเข้าบัญชีเพื่อจ่ายค่าหอพัก",
            "situation": "เพิ่งถอนเงินจาก 7-Eleven ใกล้ๆ แล้วต้องเอามาฝากเข้าบัญชีทันที",
            "memoryHook": "deposit จำว่า \"ดิ-พอ-ซิท\" = เอาเงินเข้า (พอแล้วใส่เข้าไป)",
            "pronunciation": "ไอด์ ไลค์ ทู ดิ-พอ-ซิท แคช."
          },
          {
            "englishPhrase": "Can I get an account balance receipt?",
            "thaiContext": "ที่สาขาใน MBK หลังฝากเงินเสร็จ ขอใบเสร็จที่แสดงยอดคงเหลือเพื่อแนบให้ฝ่ายกิจการนักศึกษาที่มหาวิทยาลัย",
            "situation": "ต้องใช้เอกสารยืนยันยอดคงเหลือในการสมัครที่พักของมหาวิทยาลัยเกษตรศาสตร์",
            "memoryHook": "balance = ยอดคงเหลือ; receipt = ใบเสร็จ จำว่า \"ริ-ซีท\" = รีบซี้ดกระดาษหลักฐาน",
            "pronunciation": "แคน ไอ เก็ต แอน อะ-เคานต์ แบะ-เลินซ์ ริ-ซีท?"
          },
          {
            "englishPhrase": "I need to enter my PIN.",
            "thaiContext": "ที่ตู้ฝากเงินสดหน้า BTS Skytrain สยาม บอกเพื่อนให้รอสักครู่ขณะป้อนรหัส และใช้มือบังปุ่มเพื่อความปลอดภัย",
            "situation": "รีบฝากเงินก่อนขึ้นรถไฟฟ้าไปเรียนที่ธรรมศาสตร์",
            "memoryHook": "PIN = รหัสสี่ถึงหกหลัก จำว่า \"พิน\" = ปักหมุดความลับ ห้ามบอกใคร",
            "pronunciation": "ไอ นีด ทู เอ็น-เทอะ มาย พิน."
          }
        ],
        "memoryHooks": [
          "คิดเป็นลำดับ: เข้า (บัตร) → ลับ (PIN) → ฝาก (เงิน) → พิมพ์ (ใบเสร็จ)",
          "ป้องกัน PIN ด้วยมือบังแป้น กดชิดจอ และมองรอบๆ ก่อนทำรายการ",
          "ขอใบเสร็จที่มีเวลาทำรายการและยอดคงเหลือทุกครั้งเพื่อใช้เป็นหลักฐาน"
        ],
        "summaryPoints": [
          "เตรียมเงินสดและข้อมูลบัญชีให้พร้อมก่อนฝาก",
          "แยกแยะพนักงานด้วยยูนิฟอร์ม/ป้ายชื่อเพื่อรับความช่วยเหลือที่ถูกต้อง",
          "ใช้รหัส PIN อย่างปลอดภัยเมื่อทำรายการที่ตู้",
          "ขอใบเสร็จพร้อมยอดคงเหลือเพื่อยืนยันธุรกรรม"
        ]
      }
    ],
    "keyVocabulary": [
      {
        "word": "recommend",
        "thaiTranslation": "แนะนำ",
        "memoryHook": "จำว่า recommend = แนะนำ เหมือนเวลาเพื่อนพูดว่า ‘รีคอมเมนด์’ เมนูที่ After You",
        "contextExample": "Can you recommend a short action book? - พูดกับบรรณารักษ์ที่หอสมุดจุฬาฯ เพื่อขอคำแนะนำหนังสือเล่มสั้นๆ ก่อนจะไปยืมออก"
      },
      {
        "word": "section",
        "thaiTranslation": "หมวด",
        "memoryHook": "section อ่านว่า เซคชัน นึกถึงโซน/แผนกในห้าง Central World ที่แบ่งเป็นหมวดชัดเจน",
        "contextExample": "Where is the adventure section? - ถามพนักงานร้านหนังสือที่ Central World เพื่อหาหมวดผจญภัย"
      },
      {
        "word": "borrow",
        "thaiTranslation": "ยืม",
        "memoryHook": "borrow ฟังคล้าย ‘บอโร่ว์’ ให้นึกถึงการบอกว่า ‘ขอยืมหน่อยนะ’ เวลาเอาหนังสือไปยืมจากห้องสมุด",
        "contextExample": "Can I borrow this book with my library card? - บอกเจ้าหน้าที่ที่หอสมุดธรรมศาสตร์ว่าต้องการยืมโดยใช้บัตรห้องสมุด"
      },
      {
        "word": "check out",
        "thaiTranslation": "ยืมออก (จากห้องสมุด)",
        "memoryHook": "จำแบบเชื่อมกับการ ‘เช็คเอาต์’ โรงแรม Novotel คือขั้นตอนสุดท้ายก่อนออก; ในห้องสมุด check out คือขั้นตอนยืมออก",
        "contextExample": "I'd like to check out these two books. - พูดกับเจ้าหน้าที่ที่เคาน์เตอร์ยืมออกของหอสมุดมหิดล"
      },
      {
        "word": "deposit",
        "thaiTranslation": "ฝากเงิน",
        "memoryHook": "นึกว่า deposit = ดีพอสิทธิ์ ฝากเงินไว้ดีๆ จะได้สิทธิ์และสลิปยืนยัน",
        "contextExample": "I need to deposit this check. - แจ้งพนักงานธนาคารสาขาใน Central World ว่าจะฝากเช็ค ก่อนแวะกินของหวานที่ After You"
      },
      {
        "word": "PIN",
        "thaiTranslation": "รหัสพิน",
        "memoryHook": "พินเหมือน ‘ปักพิน’ ในแอป แต่ของธนาคารคือรหัสลับ 4–6 หลักที่ต้องไม่บอกใคร",
        "contextExample": "Please enter your PIN. - พนักงานบอกตอนคุณใช้บัตรที่ตู้ฝากเงินอัตโนมัติใกล้ BTS สยาม"
      },
      {
        "word": "account balance",
        "thaiTranslation": "ยอดเงินคงเหลือ",
        "memoryHook": "balance แปลว่าสมดุล ให้นึกถึงเงินที่ยังคง ‘บาลานซ์’ อยู่ในบัญชี = ยอดเงินคงเหลือ",
        "contextExample": "Can I get my account balance on the receipt? - ขอให้ธนาคารใน Big C พิมพ์ยอดเงินคงเหลือบนสลิปหลังทำธุรกรรมฝากเงิน"
      },
      {
        "word": "receipt",
        "thaiTranslation": "ใบเสร็จรับเงิน (สลิป)",
        "memoryHook": "receipt ออกเสียงคล้าย ‘รีซีต’ จำว่า ‘รี-เก็บสิทธิ์’ ต้องเก็บใบเสร็จไว้เป็นหลักฐาน",
        "contextExample": "Could I have a receipt for these books? - ขอใบเสร็จตอนจ่ายเงินค่าหนังสือที่ร้านใกล้ MRT จตุจักร เพื่อเก็บไว้ตรวจรายการ"
      },
      {
        "word": "fiction",
        "thaiTranslation": "นิยาย",
        "memoryHook": "fiction ใกล้คำว่า fake ทำให้นึกว่าเป็นเรื่องแต่ง = นิยาย",
        "contextExample": "Is the fiction section on the second floor? - ถามพนักงานร้านหนังสือหลังลง BTS สยาม เพื่อหาหมวดนิยายบนชั้นสอง"
      },
      {
        "word": "mystery",
        "thaiTranslation": "นิยายสืบสวน",
        "memoryHook": "mystery ฟังเหมือน ‘มีทริก’ มีปริศนาให้ไข นึกถึงเชอร์ล็อกโฮล์มส์แล้วจำว่าเป็นนิยายสืบสวน",
        "contextExample": "Do you like mystery novels by Agatha Christie? - ชวนคุยกับเพื่อนที่ TRUE Coffee เรื่องความชอบแนวสืบสวนก่อนเลือกรายการหนังสือ"
      }
    ],
    "grammarPoints": [
      {
        "structure": "Present Simple for habits, facts, and preferences",
        "explanation": "Used to talk about routines, general truths, and likes/dislikes.",
        "thaiExplanation": "ใช้ช่อง V1 เพื่อบอกนิสัย ข้อเท็จจริง และความชอบ เช่น I like…, She works…, Do you…?",
        "examples": [
          "Do you eat fish?",
          "My wife likes spicy food but I do not.",
          "I prefer short books."
        ]
      },
      {
        "structure": "Present Continuous (be + V-ing)",
        "explanation": "Describes actions happening now, around now, or temporary situations.",
        "thaiExplanation": "ใช้ be + V-ing เพื่อบอกสิ่งที่กำลังเกิดขึ้น/ช่วงเวลานี้ หรือสถานการณ์ชั่วคราว",
        "examples": [
          "Are you enjoying your stay at our hotel?",
          "My wife and I are having a great time.",
          "What kind of book are you looking for?"
        ]
      },
      {
        "structure": "Modals for requests/offers/permission (can, may, would)",
        "explanation": "Use modal + base verb to ask politely, make offers, or ask permission.",
        "thaiExplanation": "ใช้ can/may/would + V1 ในการขอร้อง เสนอ หรือขออนุญาตอย่างสุภาพ",
        "examples": [
          "Can you recommend a nice restaurant?",
          "May we please have a table for two?",
          "Would you also like to add a salad on the side, sir?"
        ]
      }
    ],
    "comprehensionQuestions": [
      {
        "question": "คุณจะพูดอะไรเมื่อช้อปปิ้งที่ Big C ราชดำริ เพื่อหานิยายแนวผจญภัย/แอ็กชันประมาณ 200 หน้า? ฝึกพูด: 'Where is the book section? I'm looking for an adventure novel around 200 pages.'",
        "questionTh": "เมื่อคุณไปช้อปที่ Big C ราชดำริ และอยากหานิยายแนวผจญภัยหรือแอ็กชันที่ไม่ยาวเกินไป (ราว 200 หน้า) คุณควรถามพนักงานอย่างไร?",
        "expectedAnswer": "Where is the book section? I'm looking for an adventure novel around 200 pages. - ประโยคนี้ถามหาตำแหน่งแผนกหนังสือและบอกความต้องการทั้งแนว (ผจญภัย/แอ็กชัน) และความยาวโดยประมาณ ช่วยให้พนักงานพาไปที่แผนกได้เร็วและคัดเลือกเล่มที่เหมาะได้",
        "context": "Big C ราชดำริอยู่ตรงข้าม CentralWorld และมักมีมุมหนังสือ/นิตยสาร การระบุแนวและจำนวนหน้าช่วยประเมินความยาวที่อ่านจบได้ตามความสนใจ คล้ายการค้นหาหมวดหมู่ในห้องสมุดก่อนนำไปเช็กเอาต์"
      },
      {
        "question": "คุณต้องรีบไปคืนหนังสือที่ TK Park CentralWorld ก่อนถึงกำหนด คุณจะถามทางไป BTS สยามอย่างไร? ฝึกพูด: 'Excuse me, how do I get to BTS Siam?'",
        "questionTh": "ถ้าคุณอยู่แถวสยาม/ราชประสงค์และต้องรีบไปคืนหนังสือให้ทันกำหนด คุณจะถามทางไป BTS สยามอย่างไรเพื่อไปให้เร็วที่สุด?",
        "expectedAnswer": "Excuse me, how do I get to BTS Siam? - เป็นประโยคสุภาพ กระชับ ใช้ได้กับเจ้าหน้าที่หรือคนพื้นที่เพื่อขอเส้นทางไปสถานี BTS สยาม ซึ่งเชื่อมต่อได้สะดวกและช่วยให้ไปคืนหนังสือทันกำหนด",
        "context": "จาก CentralWorld เดินสกายวอล์กไป BTS ชิดลมแล้วต่อไปสยาม หรือเดินสกายวอล์กยาวไปสยามโดยตรง เมื่อถึง TK Park แล้ว ขั้นตอนยืม-คืนคือยื่นบัตรสมาชิกที่เคาน์เตอร์เช็กเอาต์/รีเทิร์น และตรวจสลิป due date ให้เรียบร้อย"
      },
      {
        "question": "คุณจะถามอะไรที่แผนกต้อนรับโรงแรม Novotel Bangkok Siam Square หากอยากสมัครบัตรสมาชิกห้องสมุดใกล้ๆ และต้องการธนาคารเพื่อทำธุรกรรม? ฝึกพูด: 'Excuse me, is there a library nearby where I can make a library card? And where is the nearest Bangkok Bank?'",
        "questionTh": "เมื่อเข้าพักที่ Novotel Bangkok Siam Square และต้องการทั้งสมัครบัตรสมาชิกห้องสมุดใกล้ๆ และถามหาธนาคารสำหรับทำธุรกรรม คุณจะสอบถามแผนกต้อนรับว่าอย่างไร?",
        "expectedAnswer": "Excuse me, is there a library nearby where I can make a library card? And where is the nearest Bangkok Bank? - ประโยคแรกถามหาห้องสมุดที่ทำบัตรสมาชิกได้ (เช่น TK Park ที่ CentralWorld) ประโยคที่สองถามหาธนาคาร (เช่น Bangkok Bank) เพื่อทำธุรกรรม เช่น ชำระค่าธรรมเนียมหรือถอนเงิน",
        "context": "จาก Novotel Siam Square เดินไป CentralWorld เพื่อสมัครสมาชิก TK Park ได้ (มักใช้บัตรประชาชน/พาสปอร์ต และมีค่าธรรมเนียมเล็กน้อย) ย่านสยามมีสาขาธนาคารหลายแห่ง การวางแผนเส้นทางทั้งทำบัตรและทำธุรกรรมในทริปเดียวช่วยประหยัดเวลา"
      },
      {
        "question": "คุณจะสั่งอาหารที่ TRUE Coffee เป็นภาษาอังกฤษอย่างไร? สมมติคุณอยู่ที่ TRUE Coffee สยามสแควร์วันก่อนแวะไปยืมหนังสือ ฝึกพูด: 'Could I have a large iced Americano with less sugar, and a butter croissant, please?'",
        "questionTh": "ถ้าคุณอยู่ที่ TRUE Coffee สยามสแควร์วันและต้องการสั่งอเมริกาโน่เย็นหวานน้อยและครัวซองต์ คุณจะสั่งเป็นภาษาอังกฤษอย่างไร?",
        "expectedAnswer": "Could I have a large iced Americano with less sugar, and a butter croissant, please? - โครงสร้างสุภาพ ชัดเจน ระบุขนาด เมนู และความหวาน ช่วยให้การรับออเดอร์รวดเร็ว ก่อนจะไปทำธุระที่ห้องสมุดต่อ",
        "context": "ร้าน TRUE Coffee แถบสยามมีลูกค้าต่างชาติ พนักงานคุ้นเคยกับคำสั่งภาษาอังกฤษ การระบุรายละเอียดช่วยลดความคลาดเคลื่อน เมื่อพักดื่มเสร็จสามารถไป TK Park/ห้องสมุดใกล้เคียงเพื่อเลือกหมวด Adventure/Action และเช็กเอาต์หนังสือ"
      },
      {
        "question": "คุณจะร้องเรียนเรื่องอาหารที่ Terminal 21 อย่างไร? สมมติทานที่ Pier 21 (ฟู้ดคอร์ท) สาขาอโศก แล้วอาหารเค็มมาก ฝึกพูด: 'Excuse me, this is too salty. Could you please change it?'",
        "questionTh": "คุณทานอาหารที่ Terminal 21 อโศก แล้วพบว่าอาหารเค็มเกินไป คุณจะร้องเรียนอย่างสุภาพเป็นภาษาอังกฤษอย่างไร?",
        "expectedAnswer": "Excuse me, this is too salty. Could you please change it? - เป็นการร้องเรียนอย่างสุภาพ ชี้ปัญหาตรงจุดและขอเปลี่ยนอาหาร เหมาะกับสถานที่ที่มีนักท่องเที่ยวต่างชาติและพนักงานเข้าใจภาษาอังกฤษ",
        "context": "Pier 21 ที่ Terminal 21 อโศกเป็นฟู้ดคอร์ทยอดนิยม หากอาหารมีปัญหาให้แจ้งพนักงานทันทีเพื่อแก้ไข จากนั้นสามารถไปทำธุระต่อ เช่น แวะธนาคารในห้างหรือเดินทางต่อด้วย BTS อโศก เพื่อไปห้องสมุด/กลับบ้านทันวันกำหนดส่ง"
      }
    ],
    "originalSegments": [
      "Finding and Borrowing the Right Book",
      "Bank Counter Basics and Discussing Mystery Fiction"
    ]
  },
  "seriesInfo": {
    "seriesTitle": "Everyday English in Real Life: Dining, Errands, and Daily Habits",
    "seriesTitleTh": "หลักสูตรการเรียนภาษาอังกฤษ: Everyday English in Real Life: Dining, Errands, and Daily Habits",
    "episodeNumber": 2,
    "totalEpisodes": 3,
    "description": "Find and borrow the right book, ask staff for recommendations, discuss genres (including mystery fiction), and complete basic transactions at a bank counter with clarity.",
    "descriptionTh": "Find and borrow the right book, ask staff for recommendations, discuss genres (including mystery fiction), and complete basic transactions at a bank counter with clarity."
  },
  "audioUrl": null
}